{"podcast_details": {"podcast_title": "How to Money", "episode_title": "Friday Flight - Pet Debt, Job Hopping, & Goldilocks Cash #711", "episode_image": "https://www.omnycontent.com/d/programs/e73c998e-6e60-432f-8610-ae210140c5b1/63841c13-0d18-43da-80af-ae320005b8a3/image.jpg?t=1690989660&size=Large", "episode_transcript": " At Metro by T-Mobile, there's nada yada yada. That means no contracts, no price hikes, and no surprises. We don't even hide what the lawyers make us say. We put it first. When we say no price hikes, we mean when you join Metro, your price will never increase for talk, text, and smartphone data. Our only exclusions are for limited time promos, free charges, and third party services. Nada yada yada means wireless without the gacha. At Metro. We all know that feeling of finding yourself stuck on the side of the road or struggling to get your vehicle running. But now you can avoid that pain by getting your vehicle the parts it needs before that break down oh no moment. With eBay guaranteed fit and over 122 million parts and accessories, you can make sure that your ride stays running smoothly. For the parts and accessories that fit your vehicle, just look for the green check. Get the right parts, the right fit, and the right prices. EbayMotors.com Let's ride. With eligible items only. Exclusions apply. With no fees or minimums, banking with Capital One is the easiest decision in the history of decisions. Even easier than deciding to listen to another episode of your favorite podcast. And with no overdraft fees, is it even a decision? That's banking reimagined. What's in your wallet? Terms apply. See CapitalOne.com slash bank. Capital One NA member FDIC. Welcome to How to Money. I'm Joel. I'm Matt. And we're managing pet debt, job hopping, and Goldilocks Cash. Of course, everyone knows that on our Friday Flights, we cover the top stories from this past week. What we're going to do, the stories that we think you need to be paying attention to, because they are going to directly impact your finances. This is Joel. Before we get to the stories, I wanted to share a quick little DIY bike repair win. I've got a confession to make, which is I have not been taking care of my bike very well. Sing an Usher song. No. Say that for Emily. Okay. That's how you serenade her, right? That's right. No. In the past few months, my bike's been making weird noises, it's been clicking, it hasn't been shifting properly, and specifically- At least it's not growling. That'd be really disconcerting. The final straw was that it got to where on my front brake, I would squeeze it pretty hard and it would make this loud popping sound, like this click, and I would lose my brake. My braking power would diminish significantly. This past week- That's a really important part of your bike. That's a major one, right? That's not the one you can ignore. I thought, dang it, what the heck? Okay, so I had some time this past week and focused on the bike, adjusting the derailleur, setting the upper lower limits or whatever. That's not that big of a deal. But the brakes, I guess in my biking history, I've never really dealt with disc brakes all that often. I'm trying to figure this out. It seems kind of complicated and honestly, it looked like it was broken. I'd squeeze the lever and the little, or I squeezed the handle and the little lever that gets pulled that squeezes the brake pads onto the disc. It would pop, it would look like honestly that it would dislocate. I thought, of course, I've got to now drop, I don't know, like 100 bucks on some fancy disc brakes or something like that. It's going to be a huge pain in the butt, plus the time, of course. But before I did that, I thought, let me see if I can enter my symptoms within the old YouTube, see if anybody else has dealt with the same problem. Kind of like WebMD for bikes. For WebMD for anything that's broken in my house. And seriously, within five minutes, I had not only identified what was going on, but how to fix it in the comments, like the first comment someone had responded and they said, hey, I actually made a video on how it is that you can fix this problem. Nice. Hopped over there. Literally, it only required me taking an Allen wrench. And so it's the brake pad on the other side of the disc. It had just worn down. And so you squeeze the one piston and it pushes the disc over and had to travel all the way across and evidently that little arm, it's not made to travel that far. And so you literally just unscrew this brake pad adjuster on the other side. It centers the disc and now my braking power is back to full strength. And it literally took, it's like a five second adjustment. I was just like, zoop, just turned it and I'm good to go. Man, so many things in life are actually not nearly as hard as we built them up to be. It's just because you don't know what it is to do, right? It's like almost like a fear of the unknown or you're just like, I mean, I was dreading the worst. I'm like, oh, I'm going to have to just total my bike and just buy a brand new bike. I immediately went to worst case scenario, but that's not the case. We're just so lucky to live in the era of YouTube. Granted, yes, it can be an attention sock if you're watching the wrong stuff and you're watching it too much, but man, sometimes you get lucky. Sure. There really are solutions to so many problems, external problems, not the internal ones take different kinds of work, I think. But yeah, so many problems, including fix it kind of stuff around the house, on your bike, your car, whatever. That's why I wanted to share this. Use it to your advantage. To encourage folks instead of thinking, okay, we got to hire somebody, just spend a few minutes searching YouTube, searching Google, seeing if you can find something. And not find that 30 minutes and just a little bit of elbow grease gets you done. And it can not only save you money now, but it's the like, I know this now for the rest of my life. Like anytime I've got a disc brake that's set up with a single piston, whatever, I just I learned some of these terms. I don't know it exactly, but I know that the other side, you have to occasionally adjust it out. So it keeps the rotor centered that way. It makes so much sense to because I remember looking down and like, why does, why is my actual rotor flexing a little bit? Because like when I squeeze it, did I always do that? I don't know. But guess what? It doesn't do that anymore. I will never have that problem again, nor will any of the bikes in our household. And hopefully you can take this lesson and apply it to different fixes within the things that you manage, the different things that we have to maintain. Since you're talking about biking in our households. Just for a second, I want to say gas prices have gone up significantly in the past couple of months. It seems like I swear I was shocked the last time I went to the gas station. I feel like they've gone up 45, 50 cents a gallon. And so now's the perfect time to get your bike in shape, get back on it. As gas prices go up, they impact your wallet more and more. Every ride you take on your bike cuts down on your gas consumption. It keeps your car in better shape. Not to mention now it's, this is the best time of year to start considering biking again too. As the temperatures are starting to cool down, literally a couple of days ago, it was the first ride so far since it's not technically post summer yet. It's still going to get hot, I'm sure. But I started riding it. I thought, Ooh, I'm kind of, it's a little chilly this morning. I mean granted it was like six in the morning or whatever, but I was like, Oh, this is awesome. This is great. Yeah. It is that right time. And it's not snowing in Minnesota yet. Not yet. Probably next week. Yeah. In Denver it will be snowing in like a couple of weeks. Yeah. All right. Let's get to the Friday flight math, the sampling of stories we found interesting this week. Let's start by talking about a topic that we've gotten pushback on every time we discuss this and it's how much people spend on pets. And it's not because you and I don't like goldfish or hamsters or puppy dogs. We're totally fine with all the above. I love a new puppy that I get to pet for two minutes. As long as I don't have to keep it. On the sidewalk. I mean someday I think we would love to have a dog in our family, but not right now. Not right now. Yeah. We are not at that point. But a new survey revealed that 78% of Americans say that they're willing to go into debt for their pet. And I'm sure everyone can guess what we think of that. It's a bad idea, right? Do not go into debt for your pet. It's great that you love your cat. It's like a Dr. Seuss story. Yeah. Debt for your pet. Stop. Do not do that for your pet. It rhymes too. Yeah, exactly. But even if you love the hamster, if you can resuscitate it yourself, that's fine. But don't pay a vet to thousands of dollars to do that for you. We just don't want you to screw up your finances because of your attachment, your affinity for the four-legged creature in your house. And we've just, like I said, we've talked smack about how much more Americans are spending on their animals these days. It's skyrocketed really in recent years. And it's not that it's not okay to spend more if that brings you joy, right? And you've budgeted for that purpose. But that's the key. Having and allocating money for that purpose, right? Putting pet care expenses on a credit card though that you can't pay off in full and on time at the end of the month, that is what's a bad idea. And for some reason, more than three quarters of people say, no, it's fine when it comes to my pet. I don't mind sticking on a credit card and I get the impulse, but it's better, it's far better to prepare in advance to be saving up instead so that you're not put in that position. Exactly. And again, if your pet is your craft beer equivalent, I am fine with you spending lavishly on your pet. We just want you to go into that purchase when you adopt or buy a pet with your eyes wide open. And you need to do it as an adult. You need to be prepared for some of those additional costs that accompany, some of those hidden costs that accompany being a pet owner. That means a line item in your budget and additional savings on hand to take care of even those unfortunate instances that might come along. Exactly. Yeah. Okay. So some folks might think that pet insurance policies, that those might be the solution for some of those unforeseen accidents or just the inevitable shots and visits that take place when you just have a cat or a dog. But pet insurance is not the solution. And to state it plainly, they are bad financial products. When you think about the, so not only are the premiums skyrocketing, there have been stories written about that recently. The deductibles are pretty high, but then you've also got the limits on the different policy payouts. You consider all of that, you're going to be better off self-insuring. And so you just would take what you would have paid in premiums and instead just funnel that into your high yield savings account. Again, create an itemized bucket, a sinking fund. A lot of folks end up making the purchase in order just to gain some peace of mind. And given the current state of that market, we want folks to completely avoid it altogether. Yeah, Matt. And the way you just said it, it kind of sounds like a one size fits all solution. And that might be a slight oversimplification, but it's pretty darn directionally accurate. The pet insurance policies- For the majority of folks. For most people, it is throwing away money instead of those, if you've seen your premiums go up quite a bit, a lot of those policies allow for up to 20% increases every single year. And a lot of people have felt that, like have actually gotten price increases that large for years and years in a row. And even beyond that, yeah. Is it the journal that documented certain insurers who have, even though they stated from the- They've broken that contract. Yes, exactly. And so I don't, yeah, there doesn't seem to be any consequences or any retaliation. Yeah, no repercussions. Yeah, break that. And so that's the better word. Yeah, the only repercussion is that you then say, okay, I don't want this piece of junk. I'm going to start saving for myself. I don't need your overpriced insurance policy anymore. And that's how they're going to feel it. You're going to have to be competitive for your money and offer a better product. And a lot of these pet insurance policies, they're bad products. Let's talk about another kind of insurance though, Matt, that more people are flocking to, that also might not be a great deal. And that is travel insurance. There's probably a little more nuance on this one than there is pet insurance. The Wall Street Journal wrote about travel insurance this past week and how different providers have been crushing it recently. They're making a lot of money. But as a lot more people buy these products, it's lining their pockets, but at the expense of yours. And so whether it's because folks are worrying about bad storms or even the lingering impact that COVID is having on travel plans, that's kind of what's pushing them in that direction. And honestly, it's not too expensive either, right? For someone who's younger and healthier, that travel insurance policy isn't going to be crazy, nasty expensive. It can potentially work out financially, but just because it seems affordable, that doesn't necessarily mean it's a smart move because there can be a lot of exclusions in these policies. Similar to pet insurance, you've got to read the fine print in order to decide if it's going to make sense for you. For instance, you might be worried about bad weather, but that insurance isn't going to save the day if your flight isn't actually canceled, right? Or if you're concerned about getting sick, well, it better not be because of a preexisting condition because that's not going to be covered either. You have to know that going into it before you click purchase. That's true. But it's not that travel insurance is a scam. You just need to know, again, what the fine print is of the plan that you're considering. And often there are just better ways of achieving that peace of mind than going with trip insurance. You could go to a website like Insure My Trip, and that'll allow you to shop the open market in hopes of saving on some travel insurance. But getting it through your credit card, that is almost always a better idea than buying a separate standalone policy. The Chase Sapphire Preferred card, for instance, that is a great card to get for that specific purpose. It's got up to $10,000 in trip cancellation coverage per person, up to $20,000 per trip. That's a really nice sounding expensive vacation. I've never taken vacation anywhere close to that. That is so much money. But your trip, it doesn't even need to be canceled before some of these different benefits kick in. Again, this is just one card where I'm just highlighting some of the benefits that the Preferred card offers. So for instance, you get $500 per ticket for a delay of more than 12 hours. This is awesome. Of course, you need to make sure that you're handling your credit card properly. Anytime we talk about the different benefits that credit cards are offering, we always state that because if you are paying interest, because you're not paying off your statement every single month, you're losing out. It doesn't really matter how many of the different benefits you take advantage of. Sort of like gambling, actually, which we're going to talk about here later on, but the house always wins. The bank always wins if you are paying interest. But we do want to mention this because this is one of those little known, or maybe, I don't know, little less often talked about benefits that credit cards offer. We actually talked about some of the different unique benefits that credit cards offer back in episode 683. So if you haven't listened to that one, be sure to check it out. But bottom line, both trip insurance and pet insurance is one of those things where it seems like the responsible thing to do. It is not like life insurance. Right. Auto insurance, homeowners. Rent insurance. Yeah. These are things that are either required by law or if the terrible thing were to happen, it would completely devastate your finances. That's not the case. Where the worst thing to happen is your trip gets canceled. Yeah, you're going to be out some money or with an unexpected medical vet bill. Yeah, it's going to hurt a little bit financially, but it's not going to significantly set you back. Slowly, these different insurance products have crept their way into. Oh, yeah. Oh, it's the smart, responsible, adulting kind of thing to do. There's a specialized insurance product for everything now. For everything. Exactly. And so when you buy anything online now, it's like, do you want to insure those jeans you just got? And you're like, what are you getting a hold of? I'm like, what are you talking about? It just feels like there's insurance for everything. And it always feels like the right thing to protect your stuff. But they're easier. It seems prudent. Right. It seems like the smart adulting thing to do. You're like, I'm a grown up. I guess I'll insure that thing. And there are some things where insurance makes sense, but there are a lot of other areas where insurance makes very little sense. And I know it can be kind of hard to spot. And that's kind of why we want to talk through these things and say, well, here's all the things you have to pay attention to if you're buying those things. And actually, maybe there are better ways to skin the cat so that you still get some coverage, some solid coverage via your credit card. But you don't have to go out of pocket and buy an expensive policy that you're unlikely to need and that might not even cover the things you needed to cover. Joel, how dare you say skin the cat when we're talking about pet insurance. I know. That was wrong. Sorry. All right. Let's talk about transportation for a second. Carvana, which is kind of the mega online used car seller, they have a new tool that they just launched for tracking the value of your used car. And so they kind of want you to have the equivalent of a zestiment for your ride. So should you hop over there, input your car's info and see what it's worth? Eh, I don't know. Probably not. Who cares? Did you look into it for your van? No, I did. I did not actually punch her. Man, I actually should have done that. I am curious. What was your van worth? A lot less than I thought. It was like $4,700. OK. So here's the thing. The reason Carvana is telling you that's worth. Of course. If you go to KBB.com, I guarantee you. At least two grand more. At least two grand more. Yeah. Yeah. Probably even more than that. But if you have a van that's in the condition that mine is in with the miles that it has, all things considered, that would be a steal. Yes. There's no way. It does not exist. Exactly. And so this is what Carvana wants. They want you to input it and then they want to entice you into their ecosystem so they can lowball you for your car and try to sell you on something nicer, right? They want you to upgrade. They want you to get cobwebbed into their orbit. And the reality is you're not going to get top dollar if you do. You're going to get paid a lot more selling your car in other ways than you are in all likelihood selling directly to Carvana. Is it worth maybe seeing if you're in the market to sell your car what they'll pay you? Yeah. Sure. I don't think it hurts. No harm, no foul. But at least check out multiple other forms of selling your car so you can see whether you can get paid more selling even directly to another human. It's harder to do than it ever has been before, but it doesn't mean it's not worth the time and energy. It often can be because we're talking about thousands of dollars back in your pocket, Matt. So if you're selling your car, if you listed it for eight grand tomorrow- Oh, it'd be gone. It'd be gone. Yeah. And Carvana says, oh, we'll pay you 4,700. Like just know that's how big the gap can be. You might even be able to sell yours for 10 grand. So that's what you have to take into consideration. Oh, yes, it's a hassle. It's easy to sell it directly to one of these online sites, biggest one being Carvana. But I'll do a whole lot better if I sell it myself. Sure. Yeah. I love it from the standpoint that it provides you, it's an easy way to gather data, right? Just like Zestimate. It's hard to know and to have that data on hand and to be informed. For that reason, I love it. But I also hate it for all the reasons you said, right? They're trying to make it easy. And once you kind of get within their orbit, they've got their tentacles on you. Now you're thinking about your car. You start thinking, oh, if I took that much money plus maybe some more money I've got in the bank, oh, let's see what else Carvana has to offer. Like what are they selling? Carvana is going to tell you what else they have to offer because they want you to make an upgrade. That temptation to buy is real. Their whole point of their business is just to make things easier, right? So you said it's harder than ever now to sell to another person. No, no, no. That's how we perceive it. It has remained the same, right? I don't think so, actually. To buy or sell to a private owner? I think because so many people are taking the easy way. Oh, sure. There's fewer vehicles out there for purchase directly from others and there are fewer people looking in that way too. Sure. So the inventory or just the number of cars that are out there might be fewer. Well, it's not like there are more barriers than there used to be. It's just that that has remained the same and a company like Carvana has removed barriers and they have greased the skids, man. They are trying to just get you thinking in this direction and man, they want to offer me that $4,700 so that they can turn around and sell that thing for top dollar. But hey, let's talk about jobs too because we've been talking about job hopping a lot over the last few years, I think ever since the pandemic really kicked in. But it has certainly allowed a lot of folks to massively increase their income in a hot labor market, a slew of individuals. They were able to crank up their earnings by seeking employment elsewhere. And while that's true and the possibility for increasing your earnings is definitely still there, the gap has shrunk. It's not as guaranteed. Like before, literally just floating your resume out there, it's sort of like the opposite of the car market that Carvana is offering. It's almost like an auction. Yes. And people are like, you want 90? You want 20? And like that, people were getting paid a whole lot more job hopping, especially like a year ago. Yeah. Exactly. And so another downside though that was recently documented is that when you change jobs too many times, it can start to impact your future job prospects. I think it was something like 77% of hiring managers at different companies see that as the top concern when they are hiring for a new position. It costs them a ton of money to hire somebody new and it's just a headache. You don't want to have to continue to... When you have attrition rates that high, it ends up costing your company, your business, your organization a lot of money, a lot of time that could be focused in other areas. You don't want to hire someone who's going to stick around for nine months. It's almost like going on Tinder after your fifth marriage has failed and you're like looking for the love of my life and the person who is reading your profile, if they see that, they're going to say, okay, I don't know if this person is going to stick around either. Those past actions are going to influence how they perceive you in the present. And the same is true. It's indicative, for sure. If you've job hopped once or twice in the past five years, that's one thing. But if you consistently job hop every nine to 12 months for years on end, that is going to catch up with you eventually and it's not in the best long-term interest of your career. It might be a short-term boost, but in the end, you could find that your options are limited moving forward. That's right. Yeah. It makes me think of the Carvana example. I don't think it, on one hand, it doesn't necessarily hurt to float your resume out there and see what different folks are offering and keeping an eye on the market, but it could lead to dissatisfaction with the job that you currently have. Just like with the Carvana thing, if you think you might be tempted into perusing the site and seeing, oh man, these cars are more affordable than I thought they're going to be, I think the same thing can be true of your job as well. And it could lead to you thinking, you know what, maybe I'm not happy with this job that I've had for six months. But in reality, man, what you have might be an incredible job that pays really well, but you're just, maybe you're not taking it as seriously as you could. But we've got more stories that we're going to get to. Actually, we're going to talk about gambling and how it may or may not be your ticket to wealth. We'll get to that story plus others right after this. I would obviously prefer to live a long, long time. I'm not necessarily going to the levels that some Silicon Valley types are attempting, right? No ice baths for me. But the truth is I don't have ultimate say over my end date. And because of that, I want my family to be taken care of in the event that I do pass away sooner than I'd like, right? And so because of that, I purchased a life insurance policy through Policy Genius. Yeah, a good life insurance plan can give you peace of mind that if something happens to you, your family will have a safety net to cover mortgage payments, college costs, or other expenses so that they can get back on their feet. Focus on what's most important. Policy Genius knows how valuable your time is. That's why their site makes it easy to compare life insurance quotes from America's top insurers in just a few clicks. With Policy Genius, you can find life insurance policies that start at just $25 per month for $1 million of coverage. Some options offer coverage in as little as a week and you can avoid unnecessary medical exams. Yeah, your loved ones deserve a financial safety net. You deserve a smarter way to find and buy it. Head to PolicyGenius.com to get your free life insurance quotes and see how much you could save. That's PolicyGenius.com. We all know that feeling of finding yourself stuck on the side of the road or struggling to get your vehicle running before work. It's in this moment that your heart stops and the panic sets in. But now you can avoid all of those pains by getting your vehicle the parts it needs before that breakdown oh no moment. With eBay guaranteed fit and over 122 million parts and accessories for your vehicle right at your fingertips, you can make sure that your ride stays running smoothly. Brakes and headlights, batteries, bumpers, air filters, you name it, eBay Motors has it and they'll make sure that it's the right fit for your car. So go forth, switch gears, enjoy that wind in your hair, put your favorite song on blast and say goodbye to sweating if your ride needs a little fixing up. With eBay guaranteed fit, the parts and accessories that fit your vehicle are a click away. Just look for the green check. Get the right parts, the right fit and the right prices. Head to ebemotors.com. Let's ride. Eligible items only, exclusions apply. Without savings, life can be, well, dull. Real dull. Heating up leftovers on a Wednesday night dull. But Synchrony Bank makes saving smart for your future easier with no monthly fees or minimum balances, flexible savings and great rates. Which can supercharge your savings to help you to reach your goals faster like adding a new deck with a hot tub. Or even forget the hot tub, go for the in-ground pool or dash out of town and try jumping off the deck of your bungalow in Tahiti for the week. With Synchrony Bank's safe steady savings backed by the security of FDIC insurance, you can make life's moments better. They're all about helping you save more so you can do more and go farther. So ditch the dull and go ahead. Dive into the big projects and dreams you've been waiting on. Save more, get more, do more at synchronybank.com. Member FDIC. All right. The Friday flight continues. There's a lot more money headlines. We've got to cover on this episode before we peace out and get to the weekend. But of course the thing we have to get to now is the Ludacris headline of the week. This one comes from Market Watch and the title reads, I spent $10,000 renting a storage unit but finally learned my lesson. Sounds like this one had a happy ending. I'm glad. I'm glad for the author that they finally realized the error of their ways. But this article highlights what a lot of folks need to do and a persistent problem really in our society which is that they're spending too much money on storage units and then the solution is to pare back their possessions. More than one in 10 Americans currently rent at a storage facility at an average cost of something like $165 a month. That's almost like $2,000 a year. That's a huge bill. That's a lot of money. And so they pay the bill regularly, yes, but they tend to forget about what they have in the storage unit. They're like, yeah, I gotta pay for this thing every single month but I don't even remember what I've socked away in there. It's almost like a self-imposed tax that people have levied on themselves. And I just want people to think again. If you have stuff in storage, do you know what's in there? Is there a reason that it's in there? Could you potentially get rid of or sell a lot of that stuff and get rid of that monthly payment? Yeah, so I think the author, he admitted that the stuff that was in his storage unit was actually worth much, much, much less than what he was actually paying every month to store which is pretty ridiculous. But it's a very American sort of phenomenon. Yeah, we need more space for all of our stuff. Storage units, it can make sense in the short term, right? Like if you are moving for a short period of time perhaps, you know you're moving to the city and you're gonna have a small apartment, that kind of thing. But they're a terrible long-term solution. But the business, the industry has been making money hand over fist largely because we're just unable to control our purchases and we've gotta find somewhere else to keep all that excess stuff that we've accumulated over the years. And so if, I don't know, if you feel like we've put you on the hot seat, if you feel called out here, we're not sorry at all. And we hope that you use this as a kick in the butt to declutter, to save, you don't have to go full Marie Kondo on it. I was just about to call you Matt Marie Kondo. Try to figure out what it is that brings you joy, but I think there is a way that you can just unemotionally look at some of your stuff and think, when was the last time I looked at this? When was the last time I touched this? The last time I wore this, right? Like that's a great measure when it comes to clothes that you have. Have I worn this in the past 12 months? If not, I think you could get rid of it. When you look at the past decade plus of returns, people who have invested in these storage unit facilities have crushed. Like way outpaced the S&P 500 and they may not like bandits largely because we're idiots, right? And so it's not that I wanna see those investors get crushed, but I kinda do because I want Americans to do the right thing. Because it would be an indicator of the larger American public doing what's in their best interest. Getting rid of some of those recurring bills, selling some of their stuff, or just getting rid of it in some way, form, or fashion. Piggybacking that on that though, Matt, the Wall Street Journal had an interesting article touting the end of ultra cheap stuff, as they called it. And they were talking about how factories in Asia are having a tough time finding younger workers and the results are likely to be more expensive goods over time for us here in the States. And I don't think that that is a bad thing either. Like we had this race to the bottom and it was largely factories in Asia that were producing the ultra cheap goods that we've been consuming here. Lower prices, yeah, they are a net good, but that has often come alongside compromised quality in recent years, right? We're buying stuff that is so cheap that it doesn't last. And so instead of letting price maybe drive our purchasing decisions, I think you and I, we would suggest to think more about value, right? Potentially buying something that's more expensive, that's gonna last for decades instead of months, it's still likely gonna be a better option in most cases. So if we're talking about fewer complete piece of crap particle board products, if we're talking about less of the poorly made stuff coming over here from overseas, I don't see that as an issue. Yeah, and that's not to say that you have to go out there and spend top dollar on your furniture pieces or anything like that. Look at Goodwill. Literally the boys are back in daycare now. And I asked Kate after the first day that she had reclaimed, you know, where she's had like a solid three hours of being able to do whatever it is that she wanted. I was like, what'd you do today? And she looked at me as much as like, what's a Goodwill? Because the ability to find quality stuff secondhand at some place like Goodwill, well, that's just one of the solutions to not having a ton of money on hand or just not wanting to spend a ton of money on quality products. It doesn't mean you have to go out and buy the nicest thing at some high end store. Sometimes vintage, antique, donated sort of stuff is gonna be more solidly built and it's gonna cost you less money. OK, let's talk about gambling because sports betting, it's growing like gangbusters, specifically ESPN. They've now gotten into the industry. Personally, I don't really watch a whole lot of sports all that much, so I'm not likely going to be inundated with any commercials, although I am talking about it, so I'm sure my phone is listening and I will now get the ads. You're alma mater is I believe ranked preseason number one. Number one this year. Hey, well, maybe I'll watch the championship match this year. But ESPN bet. They're going to try to convince a lot of folks to start betting on games and different matches. Don't do it though, because everyone knows that the house always wins. Again, it's one thing to say go to Vegas once a year or once every five years or something like that and just blow some money in some different casinos, right? It's a form of entertainment at that point, but I think it's entertainment categories is entertainment money in your budget. It feels like something that can that's more managed, though, as opposed to the more pernicious form of betting that's taking place in the palm of our hands via our smartphones. This kind of makes David Brooks this past week, he wrote about moral formation in the Atlantic and like we have become atomized individuals. I think this is a small example. Before you had to go to a casino and there are certain things keeping us from going back there, whether it's people see you there all the time and you don't want to necessarily become a regular at a casino. But when you can do it, when you're sitting on the toilet or you're sitting at a stoplight and you make a bet, these are some of the ways where I feel like we are losing perhaps a little bit of our moral fiber, the ability to control our behavior and ultimately leading to the American people having less money on hand. You say that, but I think part of it too is you and I are not necessarily against gambling from some sort of moral standpoint from a religious bent or anything like that. It's the form that it's taken is what I'm speaking to. Exactly, because I have played blackjack before. I find it to be enjoyable every now and again, every few years maybe and honestly it's probably been six or seven years since I've been to a casino. It's not necessarily about that, although it is for most people, it's going to be a waste of money, but it's the accessibility and how easy it's going to be for a lot of people to get into a lot of financial trouble. A lot of that financial trouble is going to breed relationship trouble, personal trouble, and so I think it's best for a lot of people to avoid this. These betting companies, FanDuel and ESPNBet and the like, they're starting to get into other versions offering different kinds of gambling as well. More novelty, they're getting into parlay bets, which means you can, and I'm not an expert on this, but bet on multiple things at once. Instead of just betting on your team to win maybe, it's like betting on your team to win while also hitting at least three home runs in that game or something like that. The odds of winning are lower on those kinds of bets, but the payouts are higher. Because the gambling apps are making even more money on these types of bets. I think these things are pulling a lot of people in, given how much marketing is going on around them and all the free money to come gamble on our app, and it's getting people hooked and maybe that first win makes you feel like, all right, this is going to be great. This is going to be my new side hustle or something like that. But this is the kind of side hustle that's going to leave a whole lot of people broke. I don't want to see people ruin their budget, but then like I said, I think it's going to lead to even ruination on even deeper, more meaningful levels like family units. So, we're again, not against gambling from the moral standpoint, but man, it's going to mess a lot of people up and we want to see people avoid it. Yeah, the downstream detrimental effects are going to impact a lot of folks. Now let's talk about having too much cash, which too much of a good thing, right? It's always- If you do, maybe you should gamble it away. I don't know. We don't want you to actually gamble it away. We do want you to invest it though. This is becoming more of a problem for folks because individuals are feeling content to keep their excess money in savings and within CDs. We are of course happy to see that you can make more in those different accounts these days because obviously savers are finally able to outpace inflation for the first time in a while. And so you might be wondering like, well, why not take the burden in the hand? Why not keep earning money month after month without any like real risk that comes with investing? But we definitely do want you to keep some cash on hand. We want you to, if we talked about self-insuring when it comes to your pets or with vacations earlier, it's important to make sure that you are accounting for some of the additional costs of the different things that you're buying. That means liquid cash reserves. Liquid savings. And when it comes to having an emergency fund, a minimum of $2,467 is what we recommend, but truly a full three to six months worth of living expenses is ideal. But beyond that though, there's a chance that you could be too cash heavy to the detriment of your ability to build wealth over the long term. It's not that you're not earning enough in the here and now. You actually are, but over the long term, that money isn't compounding and it's not growing at a rate that we have seen historically within the stock market. Even though savings rates have gone up, they're still not as high as what you're going to get in the stock market over the next couple of decades in all likelihood. And so if you're saving for a bigger goal, let's say like that home down payment in the next couple of years, that is a good reason to have extra cash on hand, right? More than you otherwise would. But other than that, I mean, investing less and adding to your cash pile when you've got decades left on your investing time horizon, that is going to cost you money over time. And so yeah, when you look at that, when you zoom out and you look at the historic returns of the stock market, it's clear that they're superior to even the rates you can get on savings right now that are guaranteed. And so again, so nice to see savings accounts finally outpacing inflation, at least by a little bit. But still, still, you can't save your way to retirement. Really you have to you have to be investing your way to get there. You have to be sucking money away inside of income producing assets. And so increased rates for savers, beautiful thing. It's just not going to be enough to get you where you want to go. You got to be investing too. So make sure you've got enough cash reserves like we talked about, but also make sure you're not sitting in so much cash that it's actually potentially hampering some of those future goals too. Yeah. You want to have Goldilocks cash. Too little, not too much. That's right. But before we wrap this Friday flight, a quick little newsletter shout out. So Tyler W. He referred the How to Money newsletter, which shows up in your inbox every Tuesday morning with helpful bits of personal finance news and information and to do's and just mindset shifts that we think are going to help you along your way to financial freedom. But he forwarded the newsletter along to some friends who signed up. So Tyler W. Thank you so much for that. And if you are not currently subscribed, you can head over to howtomoney.com forward slash newsletter. You can learn more about it and sign up there. Yeah. And if you refer the email newsletter, which is awesome to all your friends who are going to want to sign up, you can even earn How to Money socks or a beer on us, which is kind of cool. So yeah, there are. Cause that's our thing. Perks for referring ourselves. But that is our thing, beer and money, right? So that's going to do it, Matt, for this episode. We'll include links to some of the stuff that we mentioned up on our website at howtomoney.com. That's right, buddy. So until next time. We're out and best friends out. And with no overdraft fees, is it even a decision? That's banking reimagined. What's in your wallet? Terms apply. See CapitalOne.com slash bank. Capital One and a member FDIC. Why are more senior citizens using marijuana? Can football ever be safe? And what's it really like for thousands of migrants traveling the dangerous Darien Gap? Every Sunday night on CNN, the whole story with Anderson Cooper takes a deep dive into unique and compelling stories like these. One whole story, one whole hour. Featuring journalists like Dr. Sanjay Gupta, Christiane Amanpour and more. Watch the whole story with Anderson Cooper Sunday nights at 8 p.m. Eastern on CNN or listen on the iHeartRadio app."}, "podcast_summary": "In this podcast episode, the hosts discuss a variety of topics, including pet debt, job hopping, cash savings, and the rise of sports betting. They talk about the importance of not going into debt for pets and the limitations of pet insurance. They also caution against relying on travel insurance and the potential negative impacts of job hopping. The hosts emphasize the need for people to declutter and avoid excessive spending on storage units. They also discuss the increasing cost of goods and the importance of buying quality products. The hosts highlight the risks of gambling and the potential financial and personal consequences. Lastly, they touch on the balance between cash savings and investing for long-term financial growth.", "podcast_guest": {"name": "Joel", "org": "How to Money", "title": "", "summary": "Charles Joel Nordström Kinnaman (Swedish pronunciation: [ˈjǔːɛl ˈkɪ̂nːaˌman]; born 25 November 1979) is a Swedish actor. He first gained recognition for his roles in the 2010 Swedish film Easy Money and the Johan Falk crime series. Kinnaman is known internationally for his television roles as Detective Stephen Holder in AMC's The Killing, Takeshi Kovacs in the first season of Altered Carbon, and Governor Will Conway in the U.S. version of House of Cards. He has also played Alex Murphy in the 2014 RoboCop remake, and Rick Flag in the Warner Bros. film adaptations of the DC Comics anti-hero team Suicide Squad (2016), as well as James Gunn's 2021 sequel/soft reboot, The Suicide Squad. Since 2019, he has starred as NASA astronaut Ed Baldwin in the Apple TV+ science fiction drama series For All Mankind."}, "podcast_highlights": "- 78% of Americans say they're willing to go into debt for their pet.\n- Pet insurance is a bad financial product and it's better to save money instead.\n- Travel insurance is not a smart move and it's better to get coverage through your credit card.\n- Renting a storage unit can cost thousands of dollars and it's better to declutter and sell or donate unnecessary items.\n- Sports betting and online gambling apps can lead to financial trouble and should be avoided.\n- Holding too much cash can hinder wealth building and it's important to invest for the long term."}